---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCDataPrimitiveType
source: html/251abe68-f18c-a4f3-f86d-15a5fa0f9f3a.htm
---
# Autodesk.Revit.DB.IFC.IFCDataPrimitiveType

Used in operations to specify the primitive type of an IFCData.

## Syntax (C#)
```csharp
public enum IFCDataPrimitiveType
```